app/views/users/donations.html.erb

SELECT "donations".* FROM "donations" WHERE "donations"."user_id" = $1  [["user_id", 2]]
---
<h4>Sent donations</h4>
<% current_user.donations.each do |donation| %>

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 2]]
SELECT "donations".* FROM "donations" WHERE "donations"."project_id" = $1  [["project_id", 7]]
SELECT COUNT(*) FROM "donations" WHERE "donations"."project_id" = $1  [["project_id", 5]]
---
<h4> Donation received </h4>
<% current_user.projects.each do |project| %>
<% unless project.donations.count.zero? %>