app/views/users/projects.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]
---
  <div class="row">
    <% @current_user.projects.each do |project| %>

SELECT "donations".* FROM "donations" WHERE "donations"."project_id" = $1  [["project_id", 1]]
---
  <div class="row">
    <% current_user.donations.each do |donation| %>