app/views/projects/show.html.erb

<% if current_user == @project.user %>
  <% @project.donations.each do |donation| %>
---
SELECT "donations".* FROM "donations" WHERE "donations"."project_id" = $1  [["project_id", 1]]