app/controllers/donations_controller.rb

INSERT INTO "donations" ("project_id", "user_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["project_id", 7], ["user_id", 1], ["amount", 1515], ["created_at", "2018-03-02 15:37:45.315895"], ["updated_at", "2018-03-02 15:37:45.315895"]]
---
  def create
    amount = donation_params[:amount].to_i
    donation = Donation.new(amount:amount)
    donation.user = current_user
    donation.project = project

    authorize project
    donation.save!

UPDATE "donations" SET "status" = $1, "updated_at" = $2 WHERE "donations"."id" = $3  [["status", "accept"], ["updated_at", "2018-03-02 15:39:05.971272"], ["id", 1]]
---
  def update
    @donation = donation
    authorize donation
    new_status = params.require(:donation).permit(:status)[:status]
    donation.update!(status: new_status)