app/controllers/users_controller.rb

SELECT "donations".* FROM "donations" WHERE "donations"."user_id" = $1  [["user_id", 1]]
SELECT "donations".* FROM "donations" WHERE "donations"."project_id" = $1  [["project_id", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]
---
  def profile
    given_sum = 0
    @current_user.donations.map do |donation|
      given_sum += donation.amount
    end

    @total_given_dollars = given_sum

    received_sum = 0

    @current_user.projects.map do |project|